[
    {
        "description": "Ferdinand Marcos Jr, the son of the former Philippine dictator, is on the cusp of winning the Philippine presidential election by a landslide, according to preliminary and unofficial results, taking the Marcos dynasty one step closer to the Malacañang Palace, 36 years after the family fled a mass uprising.",
        "link": "https://www.cnn.com/2022/05/09/asia/philippines-election-results-marcos-robredo-intl-hnk/index.html",
        "pubdate": "Tue, 10 May 2022 06:53:50 GMT",
        "title": "Dictator's son on cusp of winning Philippine election by landslide"
    },
    {
        "description": "The US is providing more than $800 million in new humanitarian assistance to the Syrian people to continue helping those impacted by the Syrian war, US Ambassador to the United Nations Linda Thomas-Greenfield announced while speaking in Brussels at a conference to support Syria.",
        "link": "https://www.cnn.com/2022/05/10/politics/us-assistance-syria/index.html",
        "pubdate": "Tue, 10 May 2022 10:12:23 GMT",
        "title": "US to provide more than $800M in new humanitarian assistance to Syria"
    },
    {
        "description": "Sri Lanka's outgoing Prime Minister Mahinda Rajapaksa was rescued in a pre-dawn military operation Tuesday, hours after his resignation, as violent clashes between pro and anti-government protesters left several dead and 217 injured.",
        "link": "https://www.cnn.com/2022/05/10/asia/sri-lanka-protest-deaths-economic-crisis-intl-hnk/index.html",
        "pubdate": "Tue, 10 May 2022 06:47:56 GMT",
        "title": "Military rescues Sri Lanka's Prime Minister as violent clashes leave seven dead"
    },
    {
        "description": "Donkeys meander through narrow streets past doorways and through low arches, suddenly braying around corners at startled tourists while residents continue on their way, unperturbed. ",
        "link": "https://www.cnn.com/travel/article/turkey-mardin/index.html",
        "pubdate": "Tue, 10 May 2022 10:05:53 GMT",
        "title": "Mardin: Turkey's ancient treasure trove"
    },
    {
        "description": "The Federal Reserve's favorite inflation-related adjective used to be transitory, as in: Inflation is transitory and price increases should be temporary. ",
        "link": "https://www.cnn.com/2022/05/08/investing/stocks-week-ahead/index.html",
        "pubdate": "Sun, 08 May 2022 11:25:43 GMT",
        "title": "How long will inflation last? Look to the past"
    },
    {
        "description": "Turns out Trader Joe was a real guy, and his shrewd instincts led him to create a counter-culture grocery empire.",
        "link": "https://www.cnn.com/2022/05/07/business/trader-joes-history-joe-coulombe/index.html",
        "pubdate": "Sat, 07 May 2022 09:31:06 GMT",
        "title": "What Trader Joe saw that everyone else missed"
    },
    {
        "description": "For months stores nationwide have been struggling to stock enough baby formula. Manufacturers say they're producing at full capacity and making as much formula as they can, but it's still not enough to meet current demand.",
        "link": "https://www.cnn.com/2022/05/08/business/baby-formula-shortage/index.html",
        "pubdate": "Mon, 09 May 2022 14:14:10 GMT",
        "title": "The baby formula supply problem is getting worse"
    },
    {
        "description": "The United States is in a maternal health crisis. ",
        "link": "https://www.cnn.com/2022/05/08/business/mahmee-goldman-sachs-maternal-health/index.html",
        "pubdate": "Sun, 08 May 2022 12:55:59 GMT",
        "title": "The US has a maternal health crisis. Goldman Sachs wants to change that"
    },
    {
        "description": "Lake Powell, the second-largest human-made reservoir in the US, has lost nearly 7% of its potential storage capacity since 1963, when Glen Canyon Dam was built, a new report shows. ",
        "link": "https://www.cnn.com/2022/03/21/us/lake-powell-capacity-shrinking-drought-climate/index.html",
        "pubdate": "Mon, 21 Mar 2022 19:54:24 GMT",
        "title": "Not only is Lake Powell's water level plummeting because of drought, its total capacity is shrinking, too"
    },
    {
        "description": "Air pollution spiked to unhealthy levels around the world in 2021, according to a new report.",
        "link": "https://www.cnn.com/2022/03/22/world/air-pollution-2021-iqair-report-climate/index.html",
        "pubdate": "Tue, 22 Mar 2022 16:43:47 GMT",
        "title": "These were the best and worst places for air quality in 2021, new report shows"
    },
    {
        "description": "As the US attempts to wean itself off its heavy reliance on fossil fuels and shift to cleaner energy sources, many experts are eyeing a promising solution: your neighborhood big-box stores and shopping malls.",
        "link": "https://www.cnn.com/2022/03/20/us/solar-power-on-big-box-store-rooftops-climate/index.html",
        "pubdate": "Sun, 20 Mar 2022 07:01:50 GMT",
        "title": "Big-box stores could help slash emissions and save millions by putting solar panels on roofs. Why aren't more of them doing it?"
    },
    {
        "description": "If you were born before 1990, you may remember the 3D graphic of an almost-naked baby that danced on a loop to become one of the internet's earliest viral phenomenons. The strange-yet-sassy \"Dancing Baby\" began spreading via forwarded email chains in 1996 before it appeared on major news networks around the US and cha-chaed its way into the TV show \"Ally McBeal\" to remind the titular character of her ticking biological clock.",
        "link": "https://www.cnn.com/style/article/dancing-baby-meme-nft/index.html",
        "pubdate": "Thu, 05 May 2022 07:32:34 GMT",
        "title": "Remember this dancing baby? It's back with a new look"
    },
    {
        "description": "Abercrombie & Fitch's website is, today, awash with Gen-Z-friendly nods to diversity and inclusion. There are people of color, sizes up to 3XL and even a Pride-themed collection featuring \"gender inclusive\" rainbow tees. The brand's Instagram account, meanwhile, proudly promotes models in wheelchairs, stories of body-positivity and statements of LGBTQ solidarity.",
        "link": "https://www.cnn.com/style/article/abercrombie-fitch-exclusion-netflix-documentary/index.html",
        "pubdate": "Wed, 20 Apr 2022 12:47:39 GMT",
        "title": "Netflix documentary charts the troubling rise of Abercrombie & Fitch"
    },
    {
        "description": "If the thought of retiring your comfortable sweats and choosing a new outfit to leave the house in each morning is an intimidating prospect, you're in good company. For the better part of the pandemic, I've lived in a pair of stretchy, soft wool trousers in the cooler months, switching allegiance in summer to a white linen dress that my brother-in-law dubbed \"the ghost dress\" (likening its so flowy, so oversized shape to that of a large bedsheet with a hole cut out for my head). ",
        "link": "https://www.cnn.com/style/article/how-to-dress-for-the-office-styleguide/index.html",
        "pubdate": "Fri, 06 May 2022 10:24:34 GMT",
        "title": "Style Guide: How to dress for the office "
    },
    {
        "description": "Gianni Versace's former townhouse in Manhattan has gone on sale for $70 million.",
        "link": "https://www.cnn.com/style/article/gianni-versace-new-york-mansion-sothebys-intl-scli/index.html",
        "pubdate": "Wed, 04 May 2022 16:22:05 GMT",
        "title": "Gianni Versace's lavish New York mansion is on sale for $70M"
    },
    {
        "description": "Massive Native American drawings -- which remained unseen in an Alabama cave for more than 1,000 years -- have been unveiled by a team of scientists. It's the largest known cave art ever discovered in North America.",
        "link": "https://www.cnn.com/style/article/largest-native-american-cave-art-scn/index.html",
        "pubdate": "Wed, 04 May 2022 20:18:57 GMT",
        "title": "Discovery of mysterious drawings could change the way scientists look at cave art"
    },
    {
        "description": "Blake Lively paid tribute to New York City architecture in a shimmering gown that dramatically transformed as she walked the Met Gala red carpet on Monday night.",
        "link": "https://www.cnn.com/style/article/blake-lively-met-gala-2022-versace-dress/index.html",
        "pubdate": "Tue, 03 May 2022 15:40:57 GMT",
        "title": "The Met Gala's best style moment?"
    },
    {
        "description": "The Italian island of Sardinia sits in the middle of the Tyrrhenian Sea, gazing at Italy from a distance. Surrounded by a 1,849-kilometer coastline of white sandy beaches and emerald waters, the island's inland landscape rapidly rises to form hills and impervious mountains. ",
        "link": "https://www.cnn.com/travel/article/casu-marzu-worlds-most-dangerous-cheese/index.html",
        "pubdate": "Thu, 18 Mar 2021 17:32:15 GMT",
        "title": "The world's 'most dangerous' cheese"
    },
    {
        "description": "Waking up in a chic hotel room with a view of the solar system could be the future of travel, at least if space company Orbital Assembly has anything to say about it.",
        "link": "https://www.cnn.com/travel/article/space-hotel-orbital-assembly-scn/index.html",
        "pubdate": "Mon, 02 May 2022 09:05:59 GMT",
        "title": "This space hotel is due to open in 2025"
    },
    {
        "description": " ",
        "link": "https://www.cnn.com/travel/article/classic-italian-dishes/index.html",
        "pubdate": "Tue, 26 Apr 2022 12:38:53 GMT",
        "title": "30 classic Italian dishes that everyone should try"
    },
    {
        "description": "In the late 1970s, the US government deregulated the airline industry, removing federal control over fares, routes and the entry of new airlines into the market. ",
        "link": "https://www.cnn.com/travel/article/unusual-airlines/index.html",
        "pubdate": "Wed, 20 Apr 2022 13:53:49 GMT",
        "title": "Unusual airlines that really existed"
    },
    {
        "description": "The images of the wrecked Antonov AN-225 are now an indelible memory for aviation enthusiasts worldwide. ",
        "link": "https://www.cnn.com/travel/article/antonov-an-225-ukraine-rebuilding/index.html",
        "pubdate": "Mon, 18 Apr 2022 15:28:45 GMT",
        "title": "Can the world's largest plane ever fly again?"
    },
    {
        "description": " ",
        "link": "https://www.cnn.com/specials/unlocking-italy",
        "pubdate": "Tue, 15 Feb 2022 23:30:08 GMT",
        "title": "Sign up for our 9-part Italy travel and food newsletter"
    },
    {
        "description": "When a Massachusetts woman ordered a pizza on a routine Friday evening, she had no idea the quick thinking and kindness of her delivery driver would change her life that night.",
        "link": "https://www.cnn.com/2022/05/01/us/doordash-driver-saves-woman-trnd/index.html",
        "pubdate": "Mon, 02 May 2022 15:22:01 GMT",
        "title": "'She's my guardian angel': DoorDasher saves woman's life while delivering pizza"
    },
    {
        "description": "Tetiana Poudel's father, a deputy commander in Ukraine's Territorial Defense Forces, needed combat boots. ",
        "link": "https://www.cnn.com/2022/04/20/politics/citizens-funnel-supplies-ukrainian-soldiers/index.html",
        "pubdate": "Thu, 21 Apr 2022 00:00:58 GMT",
        "title": "A 'lawyer by day and a boot smuggler by night,' this Ukrainian American is helping funnel supplies to Ukrainian soldiers"
    },
    {
        "description": "A Florida deputy climbed the outside of an apartment building to rescue a one-year-old girl from a fire early Saturday and the dramatic scene was captured on the deputy's body camera, officials said.",
        "link": "https://www.cnn.com/2022/04/24/us/florida-orange-county-deputy-rescues-baby-apartment-fire/index.html",
        "pubdate": "Sun, 24 Apr 2022 14:02:23 GMT",
        "title": "Florida deputy climbs building to rescue a baby from an Orlando apartment fire"
    },
    {
        "description": " ",
        "link": "https://www.fool.com/the-ascent/credit-cards/landing/wells-fargo-reflect-review/?utm_site=theascent&utm_campaign=ta-cc-co-cnn-welref2-ron-5-hp-sfpb&utm_medium=cpc&utm_source=cnn",
        "pubdate": " ",
        "title": "0% intro APR until nearly 2024 is 100% insane"
    },
    {
        "description": " ",
        "link": "https://www.fool.com/the-ascent/credit-cards/landing/citi-simplicity-review/?utm_site=theascent&utm_campaign=ta-cc-co-cnn-citisimp2-ron-5-hp-sfpb&utm_medium=cpc&utm_source=cnn",
        "pubdate": " ",
        "title": "It's official: now avoid credit card interest into 2024"
    },
    {
        "description": " ",
        "link": "https://www.fool.com/the-ascent/credit-cards/landing/wells-fargo-active-cash-card-review/?utm_site=theascent&utm_campaign=ta-cc-co-cnn-welac2-ron-5-hp-sfpb&utm_medium=cpc&utm_source=cnn",
        "pubdate": " ",
        "title": "Experts: this is the best cash back card of 2022"
    }
]